
Train Loss: 0.0047 
Train R_squared: 0.92
Test Loss: 0.0057 
Test R_squared: 0.90

Batch size: 64 
Number of epochs: 20

Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_20 (Dense)             (None, 20)                160       
_________________________________________________________________
leaky_re_lu_15 (LeakyReLU)   (None, 20)                0         
_________________________________________________________________
dense_21 (Dense)             (None, 15)                315       
_________________________________________________________________
leaky_re_lu_16 (LeakyReLU)   (None, 15)                0         
_________________________________________________________________
dense_22 (Dense)             (None, 8)                 128       
_________________________________________________________________
leaky_re_lu_17 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_23 (Dense)             (None, 1)                 9         
=================================================================
Total params: 612
Trainable params: 612
Non-trainable params: 0
_________________________________________________________________
None
